OF_ML_Case/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  ground
    {
      type            fixedValue;
      value           uniform 0;
    }
  atmosphere
    {
      type            symmetryPlane; 
      //type            zeroGradient; 
      //type            fixedValue;
      //value           uniform 0;
    }
  front
    {
      type            cyclic;
    }
  back
    {
      type            cyclic;
    }
  inlet
    {
      type            fixedValue;
      value           $internalField;
    }
  outlet
    {
      type            fixedValue;//inletOutlet
      value           $internalField;
      intletValue     $internalField;
    }
}


// ************************************************************************* //
