OF_ML_Case/0/include/initialConditionsOF.txt
type                 atmBoundaryLayerInletVelocity;
Uref                 11.0;
Zref                 500;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   uniform 0.03;
zGround              uniform 0; 
//value                uniform (0 0 0);
