OF_ML_Case/0/include/nutGroundNS.txt
      type                 atmRoughWallFunction;

      roughnessHeight      0.03;
      roughnessConstant    0.5;
      roughnessFactor      1;
      value                uniform 0.0;
