OF_ML_Case/0/include/nutGroundOF.txt
      type                 nutkAtmRoughWallFunction;
      z0                   uniform 1.0; //0.1
      value                uniform 0.0;
