OF_ML_Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  ground
    {
      type            zeroGradient; //Normal gradient of ϕ is zero
    }
  atmosphere
    {
      type           symmetryPlane; //Normal gradient of ϕ is zero
    }
  front
    {
      type            cyclic;
    }
  back
    {
      type            cyclic;
    }
  inlet
    {
      type            zeroGradient;
    }
  outlet
    {
      type            totalPressure;
      p0              uniform 0;
      //type            zeroGradient;
      //type            fixedValue;
      //value           uniform 0;
    }
}


// ************************************************************************* //
