OF_ML_Case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            zeroGradient;
	rho             rhok;
    }
     atmosphere
    {
      type              symmetryPlane;
      //type            slip;
       // type            zeroGradient;
	//rho             rhok;
    }
  front
    {
      type            cyclic;
      rho             rhok;
    }
  back
    {
      type            cyclic;
      rho             rhok;
    }
  inlet
    {
      type            zeroGradient;
      //type            fixedValue;
      //value           $internalField;
    }
  outlet
    {
      //type             fixedValue;
      //value            uniform 0;
      
      type            totalPressure;
      p0              uniform 0;
      //type            inletOutlet;
      //value           $internalField;
      //inletValue      $internalField;
    }
}


// ************************************************************************* //
