OF_ML_Case/constant/nnProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nnProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MNum    5;
Batch_Size 420000; //15300;
device  "cuda"; // "cpu" or "cuda"
torchModelPath "path/to/traced_model.pt";

means
{
    G1      -1.489399924972761684e-02;
    G2      -4.755044535848027346e-03;
    G3      -5.021356981841817307e-03;
    G4       1.165836004060160150e-03;
    G5       4.194438661979912712e-03;
    G6      -7.468160853229418271e-03;
    S1      -1.489399924972761684e-02;
    S2      -1.794599754392460630e-03;
    S3       6.535054171694007152e+00;
    S4       4.194438661979912712e-03;
    S5      -3.274288786259660355e-01;
    S6       1.668469188708547948e-02;
    UUp1     5.339752026982032274e-02;
    UUp2    -4.053176397387823300e-04;
    UUp3    -5.058290876207997659e-03;
    UUp4     2.269756093303255257e-02;
    UUp5     1.256040093668642004e-03;
    UUp6     1.618071892288912988e-02;
    Nut      2.708342092735390727e-05;
}

stds
{
    G1      5.031895076951790280e+00;
    G2      4.257597381700127137e+00;
    G3      3.719837863452263971e+00;
    G4      9.365364640605699620e+00;
    G5      4.831617149342109840e+00;
    G6      4.929588144708406006e+00;
    S1      5.031895076951790280e+00;
    S2      4.714664269062383006e+00;
    S3      1.883901955219964464e+01;
    S4      4.831617149342109840e+00;
    S5      4.678364184686454763e+00;
    S6      5.642430736789109780e+00;
    UUp1    2.897982292141023861e-02;
    UUp2    1.203827271082497444e-02;
    UUp3    7.664545228721749912e-03;
    UUp4    1.338141428363143724e-02;
    UUp5    2.319782565086861686e-03;
    UUp6    1.389224425236955732e-02;
    Nut     3.654894558233995030e-05;
}