OF_ML_Case/system/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
|  =========                 |                                                |
|  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox          |
|   \\    /   O peration     |                                                |
|    \\  /    A nd           | Web:      www.OpenFOAM.org                     |
|     \\/     M anipulation  |                                                |
|-----------------------------------------------------------------------------|
|Description                                                                  |
|    Calculates the shear stress at wall patches, outputting the data as a    |
|    volVectorField.                                                          |
\*---------------------------------------------------------------------------*/

type            wallShearStress;
libs            ("libfieldFunctionObjects.so");

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //

